package classes;

public class Main {
	
//	Написати клас Rectangle , в якому буде описано поля : довжина, ширина.
//	Описати дані поля в конструкторі. Створити конструктор з параметрами і
//	без параметрів. Написати методи, які будуть розраховувати площу та
//	периметр. В Main класі продемонструвати створення об’єктів
//	використовуючи два конструктори. Вивести на консоль площу і периметр
//	прямокутника. Вивід на консолі повинен мати наступний вигляд: «Площа
//	прямокутника = тут буде площа », «Периметр прямокутника = тут буде
//	периметр».
	
	public static void main(String[] args) {
		Rectangle rect1 = new Rectangle();
		Rectangle rect2 = new Rectangle(35,45);
		System.out.println("Площа прямокутника = "+rect1.square());
		System.out.println("Площа прямокутника = "+rect2.square());
		System.out.println("Периметр прямокутника = "+rect1.parametr());
		System.out.println("Периметр прямокутника = "+rect2.parametr());
	
	}

}
